{
    "title": "Azerbaijan profile - Timeline",
    "link": "https://www.bbc.co.uk/news/world-europe-17047328",
    "content": [
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/4580/production/_128029771_gettyimages-995484968.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "Baku is Azerbaijan's biggest city as well as its capital"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "A chronology of key events:",
                    "style": "bold"
                }
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1828",
                    "style": "bold"
                },
                "- Turkmanchay treaty between Russia, Persia divides Azerbaijan. Territory of present-day Azerbaijan becomes part of Russian empire while southern Azerbaijan is part of Persia."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1848-49",
                    "style": "bold"
                },
                "- World's first oil well is drilled south of Baku."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1879",
                    "style": "bold"
                },
                "- Nobel brothers set up oil-production company."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1918",
                    "style": "bold"
                },
                "- Independent Azerbaijani Republic declared."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1920",
                    "style": "bold"
                },
                "- Red Army invades; Azerbaijan is declared a Soviet Socialist Republic."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1922",
                    "style": "bold"
                },
                "- Azerbaijan, part of Transcaucasian Soviet Federative Republic, becomes founder member of Soviet Union."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1936",
                    "style": "bold"
                },
                "- Transcaucasian Soviet Federative Republic dissolved ; Azerbaijan becomes full republic of Soviet Union."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1967",
                    "style": "bold"
                },
                "- Heydar Aliyev becomes head of Azerbaijani KGB; becomes head of Azerbaijani Communist Party in 1969."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1982",
                    "style": "bold"
                },
                "- Heydar Aliyev becomes full member of Soviet Politburo and first deputy chairman of USSR Council of Ministers."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1987",
                    "style": "bold"
                },
                "- Heydar Aliyev leaves Politburo and Council of Ministers."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1988",
                    "style": "bold"
                },
                "- Nagorno-Karabakh region seeks to become part of Armenia. Ethnic Azeris begin to leave Karabakh and Armenia and ethnic Armenians leave Azerbaijan. At least 26 ethnic Armenians and six Azeris are killed in violence in Azerbaijani town of Sumqayit."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1990",
                    "style": "bold"
                },
                "- Ethnic strife between Armenians and Azeris escalates. Azeri nationalist Popular Front rallies support amid growing disorder."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Trouble flares along border between Nakhichevan exclave and Iran as rioters destroy border installations. Tension eases after Soviet and Iranian authorities agree to ease restrictions on crossing between the two countries."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Dozens die in interethnic violence in Baku. Popular Front demonstrators demand resignation of communist authorities. Soviet troops use force to end unrest, killing at least 100 people. Azeri nationalists put death toll at several hundred."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Ayaz Mutallibov becomes Azeri Communist Party leader."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Communist Party later retains power in multiparty elections but parliament has an opposition for the first time."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1991",
                    "style": "bold"
                },
                "- After failed coup attempt in Moscow, Azerbaijani parliament votes to restore independence. In elections boycotted by opposition, Mr Mutallibov becomes president."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Heydar Aliyev becomes leader of the Azerbaijani exclave of Nakhichevan."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Leadership of Nagorno-Karabakh declares the region an independent republic. Inter-ethnic hostilities escalate."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1992",
                    "style": "bold"
                },
                "- Hostilities develop into full-scale war over Karabakh. More than 600 Azeris are killed as they flee an Armenian attack on Karabakh town of Khojali. Ethnic Armenian forces break through Azerbaijani territory to create a corridor linking Armenia to Karabakh."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "President Ayaz Mutallibov resigns. Abulfaz Elchibey, leader of nationalist People's Front, becomes president in Azerbaijan's first contested elections."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1993",
                    "style": "bold"
                },
                "- Armenia launches offensive into Azerbaijani territory around Karabakh."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Rebel army commander Col Surat Huseynov takes control of Azerbaijan's second city, Ganja, and marches on Baku. President Elchibey invites Aliyev to return to the capital and subsequently flees."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Mr Aliyev assumes leadership. Mr Huseynov becomes prime minister and is placed in charge of defence and security forces. Referendum indicates massive loss of public confidence in Elchibey. Aliyev wins presidential elections boycotted by Elchibey's People's Front."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1994",
                    "style": "bold"
                },
                "- Armenia, Azerbaijan and Nagorno-Karabakh sign a ceasefire accord. Ethnic Armenians remain in control of Karabakh and a swathe of Azerbaijani territory around it."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Mr Aliyev cracks down hard on People's Front. Azerbaijani forces mount Karabakh counteroffensive."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Armenia, Azerbaijan and Nagorno-Karabakh sign a ceasefire. Ethnic Armenians remain in control of Karabakh and a swathe of Azerbaijani territory around it."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Prime Minister Huseynov is dismissed and flees to Russia after accusations of involvement in an attempted coup."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1994",
                    "style": "bold"
                },
                "- Azerbaijan signs what it calls the \"contract of the century\" with a consortium of international oil companies for the exploration and exploitation of three offshore oil fields."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1995",
                    "style": "bold"
                },
                "- Government troops crush rebellion by Rovshan Javadov, the head of a special police squad. He and dozens of other rebels are killed."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Nagorno-Karabakh, now acting as an independent republic, holds legislative elections. Robert Kocharian, formerly head of Karabakh's State Defence Committee, becomes executive president."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "The New Azerbaijan Party, led by President Aliyev, wins the majority of seats in independent Azerbaijan's first multi-party elections, which, observers say, fail to meet international standards. Azerbaijan's new constitution is approved in a referendum."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1996",
                    "style": "bold"
                },
                "- Incumbent President Robert Kocharian retains his post in direct presidential elections in Karabakh."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1997",
                    "style": "bold"
                },
                "- Robert Kocharian leaves Karabakh to become prime minister in Armenia. Foreign Minister Arkadiy Gukasian is elected Karabakh president."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Former PM Surat Huseynov is extradited from Russia. Following a lengthy trial for high treason he is eventually sentenced to life imprisonment."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Aliyev and his Armenian counterpart Levon Ter-Petrosian agree to OSCE proposal for staged Karabakh solution. The Armenian leader is criticized at home for making too many concessions and subsequently resigns."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "The first oil is produced by the Azerbaijani International Operating Company under the \"contract of the century\"."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1998",
                    "style": "bold"
                },
                "- Opposition activists arrested at protests against what they say are unfair elections in which Heydar Aliyev is returned as president. International observers report irregularities."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2001",
                    "style": "bold"
                },
                "- Azerbaijan becomes full member of Council of Europe, though council officials criticise it over human rights record."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "US lifts aid ban, imposed during Nagorno-Karabakh conflict, after Azerbaijan provides airspace and intelligence after 11 September al-Qaeda attacks in US."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Azerbaijan, Georgia and Turkey reach agreement on oil and gas pipelines linking Caspian fields with Turkey."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Azerbaijan officially shifts to the Latin alphabet for the Azeri language, in the fourth alphabet change in a century."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "September - Construction work starts on multi-billion-dollar pipeline to carry Caspian oil from Azerbaijan to Turkey via Georgia."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "August - Aliyev appoints his son, Ilham, as prime minister."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "October - Ilham Aliyev wins landslide victory in presidential poll said by observers not to reach international standards. Opposition protests met with police violence; hundreds arrested."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "December - Heydar Aliyev dies in a US hospital, aged 80. He was being treated for heart and kidney problems."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2005",
                    "style": "bold"
                },
                "March - Thousands mourn after journalist Elmar Huseynov, an outspoken critic of the authorities, is shot dead in Baku."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2005",
                    "style": "bold"
                },
                "November - Ruling New Azerbaijan Party wins parliamentary elections by large margin. International observers say vote failed to meet democratic standards. Police use violence to disperse opposition protesters demanding a rerun."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2006",
                    "style": "bold"
                },
                "July - Baku-Tbilisi-Ceyhan pipeline formally opened at ceremony in Turkey after Caspian oil starts flowing along it."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2007",
                    "style": "bold"
                },
                "January - Azerbaijani state oil company stops pumping oil to Russia in dispute over energy prices."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "March - Fighting breaks out in Nagorno-Karabakh. Azerbaijan and Armenia accuse each other of starting the clashes, which leave several dead on each side."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "October - Ilham Aliyev wins a second term as president. Western observers say conduct of the election, boycotted by the main opposition parties, was an improvement on previous votes but still fell short of democratic standards."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "November - Armenia and Azerbaijan sign a joint agreement aimed at intensifying efforts to resolve their dispute over territory of Nagorno-Karabakh."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2009",
                    "style": "bold"
                },
                "March - Referendum initiative to abolish a law limiting the president to two terms is passed with nearly 92% of the vote; the move means President Ilham Aliyev would be able to stand for a third term."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2009",
                    "style": "bold"
                },
                "November - Azerbaijani-Armenian talks on Nagorno-Karabakh end without achieving major breakthrough."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "April - Head of the Armenian church, Garegin II, makes first visit by senior Armenian cleric since the Nagorno-Karabakh conflict in the 1990s."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "November - President Aliyev's New Azerbaijan Party (NAP) wins increased majority in parliamentary elections; European monitors said the vote was flawed."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "September - BP announces plans for gas pipeline from Azerbaijan to Europe, by-passing Russia."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2011",
                    "style": "bold"
                },
                "May - Azerbaijan wins Eurovision Song Contest. International human rights groups launch boycott campaign of 2012 contest in Azerbaijan over the country's human rights record."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2012",
                    "style": "bold"
                },
                "May - Azerbaijan hosts the Eurovision song contest. Anti-government protestors staged demonstrations to coincide with the event."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2012",
                    "style": "bold"
                },
                "June - Clashes on the Azerbaijani-Armenian border result in the death of soldiers on both sides."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2012",
                    "style": "bold"
                },
                "September - Armenian-Azerbaijani tension flares after Azerbaijan pardons and gives a hero's welcome to an army officer who was jailed in Hungary for killing an Armenian colleague."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2013",
                    "style": "bold"
                },
                "October - Presidential elections. President Aliyev wins another third five-year term."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "August - Deadly clashes between troops from Azerbaijan and Armenia over the disputed enclave of Nagorno-Karabakh."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "September - British Petroleum announces start of construction of Southern Gas Corridor to deliver gas to Europe directly, bypassing Russia. Pipelines scheduled for completion in 2018."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "October - Non-governmental organisations complain of official harassment, seeing it as the culmination of months of measures against the opposition and independent media."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "December - Baku shuts down the Azerbaijani service of US-funded Radio Free Europe / Radio Liberty, accusing it of working for a foreign security service. The US State Department expresses concern over what it describes as a crackdown on civil society."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2015",
                    "style": "bold"
                },
                "March - The human rights group Amnesty International says dozens of pro-democracy activists, journalists and lawyers have been detained by the authorities in past year in an effort to quash dissent. The government denies the arrests are politically motivated."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2015",
                    "style": "bold"
                },
                "June - First European Games open in Baku. Azerbaijan was the sole bidder to host the event, attracting criticism at home over the cost and abroad over its rights record."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2015",
                    "style": "bold"
                },
                "November - Ruling New Azerbaijan Party wins parliamentary elections, which main opposition parties boycotted in protest at arrests of activists and reporters. The Organisation for Security and Cooperation in Europe leading election monitoring group declined to send observers."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "April - Dozens killed in flare-up of fighting in the enclave of Nagorno-Karabakh."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "September - Voters in a referendum approve constitutional changes which extend the powers of the president."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "December - Clashes break out on the border with Armenia, killing four Armenian troops and one Azeri."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2017",
                    "style": "bold"
                },
                "February - President Aliyev appoints his wife, Mehriban, as first vice-president."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2017",
                    "style": "bold"
                },
                "February - Fighting flares up in Nagorno-Karabakh between the Azerbaijani army and ethnic Armenian troops along the line separating them."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2017",
                    "style": "bold"
                },
                "May - Opposition blogger Mehman Galandarov dies in detention."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2017",
                    "style": "bold"
                },
                "September - Azerbaijan denies reports by a group of international newspapers that it ran a secret slush fund - dubbed the \"Azerbaijan Laundromat\" - to pay off European politicians and launder money."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2020",
                    "style": "bold"
                },
                "September-November - Azerbaijan scores a major military success when it recaptures territory in and around Nagorno-Karabakh.  Some 3,000 Azerbaijani soldiers and 4,000 Armenian soldiers are killed in the conflict."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2022",
                    "style": "bold"
                },
                "September - Fighting breaks out between Armenian and Azerbaijani troops along the Armenia-Azerbaijan border, about 50 soldiers on each side are killed in the clashes."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "The Guardian"
            ]
        }
    ]
}