{
    "title": "Belgium profile - Timeline",
    "link": "https://www.bbc.co.uk/news/world-europe-17209277",
    "content": [
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/D23A/production/_127981835_gettyimages-479430151.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "The EU's Berlaymont building in Brussels - Belgium is home to several EU institutions and buildings"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "A chronology of key events:",
                    "style": "bold"
                }
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1830",
                    "style": "bold"
                },
                "- Belgium declares its independence from Netherlands."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1914-18",
                    "style": "bold"
                },
                "- World War One. Germany invades and conquers majority of the country, the Belgian army withdraws and holds its position behind Yser river until 1918."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1920",
                    "style": "bold"
                },
                "- Belgium abandons neutrality and signs military alliance with France."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1930",
                    "style": "bold"
                },
                "- Flanders and Wallonia legally become unilingual regions."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1940",
                    "style": "bold"
                },
                "- World War Two. Germany invades Belgium and Holland. Belgian government evacuates to London. King Leopold surrenders to German forces."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1944",
                    "style": "bold"
                },
                "- Allied forces liberate Belgium."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1948",
                    "style": "bold"
                },
                "- Belgium, Netherlands and Luxembourg form Benelux Customs Union to promote free movement of workers, goods and services in the region."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1949",
                    "style": "bold"
                },
                "- Belgium is a founder member of Nato."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1950",
                    "style": "bold"
                },
                "- Belgian electorate votes for Leopold's return, but after strikes and riots Leopold appoints eldest son, Prince Baudouin, to temporarily rule in his place."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1951",
                    "style": "bold"
                },
                "- Baudouin officially assumes kingship."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1951",
                    "style": "bold"
                },
                "- Belgium becomes one of the founding members of the European Coal and Steel Community"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1957",
                    "style": "bold"
                },
                "- Belgium signs Treaty of Rome as one of the six founders of the European Economic Community (EEC), now the European Union."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1960",
                    "style": "bold"
                },
                "- Belgian government grants independence to the Congo - now Democratic Republic of Congo."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1962",
                    "style": "bold"
                },
                "- Independence for Ruanda-Urundi - now Rwanda and Burundi."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1992",
                    "style": "bold"
                },
                "- Belgium ratifies Maastricht Treaty on European union."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1993",
                    "style": "bold"
                },
                "- Constitution changed to recognise division of country into three administrative regions: Flanders, Wallonia and Brussels."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "King Baudouin dies, succeeded by his brother, Albert II."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "New law gives Belgian courts right to judge anyone accused of war crimes, crimes against humanity or genocide, regardless of country of origin or where the crime is alleged to have been committed."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1996",
                    "style": "bold"
                },
                "- Arrest of Marc Dutroux on suspicion of child murder and rape leads to mass protests at perceived police inefficiency in handling the case. The investigation drags on for years amid allegations that it is being deliberately stalled."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1999",
                    "style": "bold"
                },
                "- Dioxin contamination scandal. Many nations ban Belgian food exports. Prime Minister Jean-Luc Dehaene's coalition resigns after heavy election losses. Coalition led by Prime Minister Guy Verhofstadt takes office."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2001",
                    "style": "bold"
                },
                "March - Eight die in head-on train crash, Belgium's worst rail accident in 25 years. Recorded telephone conversation suggests there was confusion between Flemish-speaking signalman and his French-speaking colleague."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "January - Euro replaces Belgian franc."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "September - Legislation decriminalising euthanasia comes into force."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "January - Legislation commits Belgium to closing its seven nuclear reactors by 2025 and banning building of new ones. Government pledges to invest in renewable energy sources and gas."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "June - US Defence Secretary Donald Rumsfeld warns that Belgium's role as Nato HQ could be in doubt unless legislation allowing Belgian courts to try foreigners for war and human rights crimes is changed. Law had led to suits being filed against many very high-profile international figures."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "July - Following elections in May, Liberals and Socialists agree to govern in coalition with Verhofstadt as prime minister for a second term."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "August - Controversial legislation allowing Belgian courts to try foreigners for war and human rights crimes dropped."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2004",
                    "style": "bold"
                },
                "June - Paedophile child killer Marc Dutroux sentenced to life for rape and murder of several young girls. His conviction came eight years after his arrest and followed complex investigations."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2004",
                    "style": "bold"
                },
                "July - Eighteen people die and over 100 are injured in gas explosion in industrial zone south-west of Brussels."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2004",
                    "style": "bold"
                },
                "November - High court rules far-right Vlaams Blok racist and strips it of funding and TV access rights, forcing it to disband. Party re-established under new name, Vlaams Belang (Flemish Interest)."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2005",
                    "style": "bold"
                },
                "May - Federal parliament approves draft of EU constitution."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2005",
                    "style": "bold"
                },
                "October - Government plans to reform pensions prompt nationwide strike action."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2006",
                    "style": "bold"
                },
                "September - Police raid army barracks and soldiers' homes as part of an investigation into the activities of extreme-right activists. A number of people are arrested for allegedly planning attacks aimed at \"destabilising\" Belgian institutions."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2007",
                    "style": "bold"
                },
                "June - Prime Minister Guy Verhofstadt resigns after his ruling coalition suffers losses in elections. He stays on in a caretaker role while talks are held on a new coalition."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2007",
                    "style": "bold"
                },
                "September - Belgium without a government for 100 days."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2007",
                    "style": "bold"
                },
                "December - Guy Verhofstadt reappointed as premier to head interim government."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "February - Main parties broker agreement which includes transfer of some minor powers to the regions, paving way for return to political normality."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "March - New government headed by Yves Leterme is sworn in, ending nine months of deadlock."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "July - Prime Minister Leterme offers to resign after failing to reach agreement on power-sharing deal between Dutch- and French-speaking regions. King Albert II refuses to accept his resignation."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "September - Together with The Netherlands and Luxembourg, Belgium agrees to inject funds into the ailing financial group, Fortis. Dutch operation later breaks away, weakening the Fortis group."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Government announces agreement with France and Luxembourg to rescue embattled Dexia bank, the world's biggest lender to local governments."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "October - Amid a worsening global financial crisis, Fortis financial group holdings in Belgium and Luxembourg is rescued by French bank BNP Paribas, which buys 75 percent of the group's shares. The deal creates one of the continent's biggest savings banks."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "December - Prime Minister Yves Leterme resigns amid a scandal over the rescue of the Fortis bank."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2009",
                    "style": "bold"
                },
                "January - The lower house of parliament confirms Christian Democrat Herman Van Rompuy as prime minister at the head of a coalition that was largely unchanged from his predecessor Yves Leterme's."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2009",
                    "style": "bold"
                },
                "November - Mr Leterme returns for a second term of office as prime minister after Mr Van Rompuy steps down to take up new post as President of the European Council."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "April - Government collapses after Flemish liberal Open VLD party quits five-party coalition in row over francophone voting rights in Flemish areas, triggering early parliamentary elections in June."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "June - The separatist New Flemish Alliance becomes largest party after federal parliamentary elections; French Socialist Party emerges as the winner in Wallonia."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "September - Belgium's Catholic Church is rocked by an official inquiry's finding that widespread sexual abuse of children by priests took place over decades."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2011",
                    "style": "bold"
                },
                "September - Caretaker prime minister Yves Leterme says he will step down to run for a senior post at the OECD, sparking a fresh crisis in the long-running deadlock over forming a new coalition."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Talks to form a new government achieve a breakthrough in reaching agreement on three key sticking points, including the division of power between French and Dutch-speaking communities."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2011",
                    "style": "bold"
                },
                "December - French-speaking Socialist leader Elio di Rupo appointed prime minister at the head of a six-party coalition, ending 541 days without a government."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2012",
                    "style": "bold"
                },
                "October - The Flemish Nationalist Party (NVA) makes major gains at local elections, becoming the largest political force in Flanders. Leader Bart De Wever becomes mayor of Antwerp, Europe's second-largest port. The NVA calls for much greater autonomy for Flanders."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2013",
                    "style": "bold"
                },
                "July - King Albert II abdicates in favour of his son Philippe."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "February - Parliament votes in favour of extending euthanasia law to terminally-ill children."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "May - Parliamentary elections. The separatist New Flemish Alliance emerges as the largest party, and the king asks its leader Bart De Wever to look into the possibility of forming a new government."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "October - After months of negotiations, Charles Michel of the Francophone liberal Reform Movement forms a coalition with three Flemish parties, including the New Flemish Alliance (N-VA). N-VA leader Bart De Wever remains outside the government as mayor of Antwerp."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "December - A nationwide 24-hour strike called by unions in protest at the government's economic austerity programme brings much of the country to a standstill."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2015",
                    "style": "bold"
                },
                "January - Two suspected Islamist militants are shot dead by police during an operation to dismantle a jihadist cell in the eastern town of Verviers."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2015",
                    "style": "bold"
                },
                "November - Government puts Brussels under maximum security alert in wake of Islamic State terror group attack on Paris, amounting to an effective lockdown of the city."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "March - Islamic State suicide bombers attack Brussels' Zaventem airport and Maalbeek metro station four days after the capture in the city of Salah Abdeslam, one of the alleged organisers of the November attacks in Paris. Thirty-five people are killed and more than 300 injured."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2020",
                    "style": "bold"
                },
                "October - Liberal Flemish Alexander De Croo forms a seven-party coalition, ending a period of interim governments since the May 2019 elections."
            ]
        }
    ]
}