{
    "title": "Djibouti profile - Timeline",
    "link": "https://www.bbc.co.uk/news/world-africa-13232162",
    "content": [
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/FC06/production/_128081546_gettyimages-1092753308.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "Djibouti is a major transport hub for the Horn of Africa"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "A chronology of key events:",
                    "style": "bold"
                }
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "825",
                    "style": "bold"
                },
                "- Islam introduced to the area."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1862",
                    "style": "bold"
                },
                "- France acquires the port of Obock."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1888",
                    "style": "bold"
                },
                "- French colony of Somaliland established over the region."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1892",
                    "style": "bold"
                },
                "- Djibouti becomes capital of French Somaliland."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1897",
                    "style": "bold"
                },
                "- Ethiopia acquires parts of Djibouti after signing a treaty with France."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1917",
                    "style": "bold"
                },
                "- Railway connecting the port of Djibouti with the Ethiopian hinterland reaches Addis Ababa."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1946",
                    "style": "bold"
                },
                "- Djibouti made an overseas territory within the French Union with its own legislature and representation in the French parliament."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1958",
                    "style": "bold"
                },
                "- Djibouti votes to join the French Community."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1967",
                    "style": "bold"
                },
                "- Referendum takes place during which Afar people and Europeans vote to remain part of the French Community; French Somaliland renamed the French Territory of the Afars and the Issas."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1977",
                    "style": "bold"
                },
                "- The French Territory of the Afars and the Issas becomes independent as Djibouti with Hassan Gouled Aptidon as president."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1979",
                    "style": "bold"
                },
                "- People's Progress Assembly party set up with a view to uniting the Afar and Issa peoples."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1981",
                    "style": "bold"
                },
                "- Djibouti becomes a one-party state with the People's Progress Assembly as the sole party."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1992",
                    "style": "bold"
                },
                "- A constitution allowing for a limited multiparty system adopted; fighting erupts between government troops and the Afar Front for the Restoration of Unity and Democracy (FRUD) in the northeast of the country."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1994",
                    "style": "bold"
                },
                "- The government and the main faction of FRUD sign a power-sharing agreement officially ending the civil war; the radical faction of FRUD continues to fight."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1995",
                    "style": "bold"
                },
                "- French Judge Bernard Borrel dies under mysterious circumstances in Djibouti. He was advising the Djibouti government, and reportedly investigating arms smuggling."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1999",
                    "style": "bold"
                },
                "- President Aptidon announces that he will not run in the presidential election; Ismael Omar Guelleh elected president."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2000",
                    "style": "bold"
                },
                "February - The government and the radical faction of FRUD sign a peace agreement finally putting an end to the civil war."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2000",
                    "style": "bold"
                },
                "March - Former Prime Minister and leader of the radical faction of FRUD Ahmed Dini returns to Djibouti after nine years in exile."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2000",
                    "style": "bold"
                },
                "December - Coup attempt said to have been masterminded by sacked police chief General Yacin Yabeh Galab fails and Yacin charged with conspiracy and breaching state security."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "January - German warships and 1,000 sailors arrive in Djibouti to patrol shipping lanes in Red Sea area, in support of US actions in Afghanistan."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "September - 1992 law allowing only three other parties to compete with ruling party expires, paving way for full multi-party politics."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "September - Djibouti says it won't be used as a base for attacks against another country in the region. Some 900 US troops set up camp in support of US-led war on terror."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "January - Coalition supporting President Ismael Omar Gelleh - the Union for Presidential Majority - wins Djibouti's first free multi-party elections since independence in 1977."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "September - Government begins drive to detain and expel illegal immigrants, thought to make up 15% of population."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2005",
                    "style": "bold"
                },
                "April- Presidential elections: Incumbent President Guelleh is the sole candidate."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2006",
                    "style": "bold"
                },
                "November - A UN report says several countries, including Djibouti, have flouted a 1992 arms embargo on Somalia by supplying the rival Islamist administration in Mogadishu. Djibouti denies the allegation."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2007",
                    "style": "bold"
                },
                "March-April- Drought declared in some inland areas. United Nations World Food Programme (WFP) says some 53,000 people could go without food rations unless funding is found."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "January - Djibouti begins legal battle with France in the International Court of Justice in The Hague over investigation into death of French judge Bernard Borrel."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "February - Ruling coalition wins all 65 seats in parliamentary elections, which are boycotted by the three main opposition parties."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "June- Fighting breaks out between Djiboutian and Eritrean troops in the disputed Ras Doumeira border area. At least nine Djiboutian soldiers killed. US condemns Eritrean \"aggression\" but Eritrea denies launching an attack."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2009",
                    "style": "bold"
                },
                "December - UN Security Council approves tough sanctions against Eritrea for supplying weapons to opponents of the Somali government and refusing to resolve border dispute with Djibouti."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "April - Parliament approves constitutional amendment allowing president to run for a third term."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "June - Eritrea, Djibouti agree to resolve their border dispute peacefully."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2011",
                    "style": "bold"
                },
                "February - Thousands gather for rare protest demanding regime change. At least two people are killed in confrontation with police."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2011",
                    "style": "bold"
                },
                "April - Guelleh wins a third term as president in an election boycotted by the opposition."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2011",
                    "style": "bold"
                },
                "June-September - Horn of Africa hit by worst drought in 60 years."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2011",
                    "style": "bold"
                },
                "December - First consignment of troops from Djibouti arrives in Somali capital, Mogadishu, to bolster the African Union force there."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2012",
                    "style": "bold"
                },
                "February - IMF approves $14m loan to boost Djibouti's drought-hit finances."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2013",
                    "style": "bold"
                },
                "February - Opposition groups contest parliamentary elections after their 2008 boycott. They reject the result, which gave the governing Union for the Presidential Majority 49 of 65 seats."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "May - Bomb blast in restaurant with several Western military personnel kills three, including two suicide bombers. Somali Islamist group al-Shabab claims responsibility."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "June - Djibouti suffers its fourth straight year of drought, a UN official says."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2015",
                    "style": "bold"
                },
                "December - Several people killed in clash with police in capital. Opposition accuses authorities of arresting supporters."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "April - President Ismail Omar Guelleh gains fourth term of office following elections, having previously said he would not run for the presidency again."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "July - The International Criminal Court says it has referred the governments of Djibouti and Uganda to the UN Security Council for failing to arrest Sudan's president, Omar al-Bashir."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "December - Djibouti says Saudi Arabia is to set up a military base in the country."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2017",
                    "style": "bold"
                },
                "June - Djibouti accuses Eritrea of sending troops into a disputed area on the border, following the withdrawal of Qatari peacekeepers."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2017",
                    "style": "bold"
                },
                "August - China formally opens its first overseas military base in Djibouti."
            ]
        }
    ]
}