{
    "title": "Turkey profile - Timeline",
    "link": "https://www.bbc.co.uk/news/world-europe-17994865",
    "content": [
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/16468/production/_128004219_gettyimages-149656472.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "Ankara has been the capital of Turkey since 1923"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "A chronology of key events:",
                    "style": "bold"
                }
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1453",
                    "style": "bold"
                },
                "- Sultan Mehmed II captures Constantinople, ending the Byzantine Empire and consolidating Ottoman Empire in Asia Minor and Balkans."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "15th-16th Centuries",
                    "style": "bold"
                },
                "- The Ottoman Empire expands into Asia and Africa."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1683",
                    "style": "bold"
                },
                "- Ottoman advance into Europe is halted at Battle of Vienna. Long decline begins."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "19th Century",
                    "style": "bold"
                },
                "- Efforts at political and economic modernisation of the empire largely founder."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1908",
                    "style": "bold"
                },
                "- Young Turk Revolution establishes constitutional rule, but degenerates into military dictatorship during World War One, where Ottoman Empire fights in alliance with Germany and Austria-Hungary."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1918-22",
                    "style": "bold"
                },
                "- Partition of defeated Ottoman Empire leads to eventual triumph of Turkish National Movement in war of independence against foreign occupation and the rule of the Sultan."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1923",
                    "style": "bold"
                },
                "- Grand National Assembly declares Turkey a republic and Kemal Ataturk president."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1928",
                    "style": "bold"
                },
                "- Turkey becomes secular: clause retaining Islam as state religion removed from constitution."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1938",
                    "style": "bold"
                },
                "- President Ataturk dies, succeeded by Ismet Inonu."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1945",
                    "style": "bold"
                },
                "- Neutral for most of World War Two, Turkey declares war on Germany and Japan in February 1945, but does not take part in combat. Joins United Nations."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1950",
                    "style": "bold"
                },
                "- First free elections won by opposition Democratic Party."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1952",
                    "style": "bold"
                },
                "- Turkey abandons Ataturk's neutralist policy and joins Nato."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1960",
                    "style": "bold"
                },
                "- Army coup against ruling Democratic Party."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1963",
                    "style": "bold"
                },
                "- Association agreement signed with European Economic Community (EEC), now the EU."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1974",
                    "style": "bold"
                },
                "- Turkish troops invade northern Cyprus."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1980",
                    "style": "bold"
                },
                "- Military coup follows political deadlock and civil unrest. Imposition of martial law."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1983",
                    "style": "bold"
                },
                "- General election won by Turgut Ozal's Motherland Party."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1984",
                    "style": "bold"
                },
                "- Kurdistan Workers' Party (PKK) launches separatist guerrilla war in southeast."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1987",
                    "style": "bold"
                },
                "- Turkey applies for full EEC membership."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1992",
                    "style": "bold"
                },
                "- 20,000 Turkish troops enter Kurdish safe havens in Iraq in anti-PKK operation."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1996",
                    "style": "bold"
                },
                "- Centre-right coalition falls. Welfare Party leader Necmettin Erbakan heads first pro-Islamic government since 1922."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1997",
                    "style": "bold"
                },
                "- Coalition resigns after campaign led by the military."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1998",
                    "style": "bold"
                },
                "- Welfare Party banned."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1999",
                    "style": "bold"
                },
                "- PKK leader Abdullah Ocalan captured in Kenya."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2001",
                    "style": "bold"
                },
                "June - Constitutional Court bans opposition pro-Islamic Virtue Party, saying it had become focus of anti-secular activities."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "January - Turkish men are no longer regarded in law as head of the family. The move gives women full legal equality with men, 66 years after women's rights were put on the statute books."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "November - Islamist-based Justice and Development Party (AK) wins landslide election victory. Party promises to stick to secular principles of constitution."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "March - AK Party leader Recep Tayyip Erdogan wins seat in parliament. Within days Abdullah Gul resigns as prime minister and Erdogan takes over."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Parliament decides not to allow deployment of US forces ahead of war in Iraq but allows US use of Turkish air space. It authorises dispatch of Turkish forces into Kurdish areas of northern Iraq."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "June-July - Eyeing future EU membership, parliament passes laws easing restrictions on freedom of speech, Kurdish language rights, and on reducing political role of military."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "November - 25 people are killed and more than 200 injured when two car bombs explode near Istanbul's main synagogue. Days later two co-ordinated suicide bombings at the British consulate and a British bank in the city kill 28 people."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2005",
                    "style": "bold"
                },
                "January - New lira currency introduced as six zeroes are stripped from old lira, ending an era in which banknotes were denominated in millions."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2006",
                    "style": "bold"
                },
                "30 September - Kurdish separatist group, the PKK, declares a unilateral ceasefire in operations against the military."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2006",
                    "style": "bold"
                },
                "December - EU partially freezes Turkey's membership talks because of Ankara's failure to open its ports and airports to Cypriot traffic."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2007",
                    "style": "bold"
                },
                "January - Journalist and Armenian community leader Hrant Dink is assassinated. The murder provokes outrage in Turkey and Armenia."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2007",
                    "style": "bold"
                },
                "April - Tens of thousands of supporters of secularism rally in Ankara, aiming to pressure Prime Minister Erdogan not to run in presidential elections because of his Islamist background."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2007",
                    "style": "bold"
                },
                "July - AK Party wins parliamentary elections. Abdullah Gul elected president the following month."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2007",
                    "style": "bold"
                },
                "October - Voters in a referendum back plans to have future presidents elected by the people instead of by parliament."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "February - Thousands protest at plans to allow women to wear the Islamic headscarf to university."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2009",
                    "style": "bold"
                },
                "October - The governments of Turkey and Armenia agree to normalise relations at a meeting in Switzerland."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "May - Relations with Israel come under severe strain after nine Turkish activists are killed in an Israeli commando raid on an aid flotilla attempting to reach Gaza."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2011",
                    "style": "bold"
                },
                "- Syrian civil war breaks out. Turkey becomes the world's largest host country for refugees, with over 3.6 million Syrian refugees."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2013",
                    "style": "bold"
                },
                "May-June - Mass anti-government protests spread to several cities, sparked by plans to develop one of Istanbul's few green spaces. The police respond with violence, and two protestors die."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2013",
                    "style": "bold"
                },
                "December - Government sacks numerous police chiefs over arrests of pro-government public figures on corruption charges. Observers see this as part of power struggle with former AK Party ally and influential US-based Muslim cleric Fethullah Gulen."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2014",
                    "style": "bold"
                },
                "August - Prime Minister Erdogan wins the first direct popular election for president."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2015",
                    "style": "bold"
                },
                "March - The \"Sledgehammer\" coup plot trial collapses when a court clears 236 military officers accused of involvement in an alleged conspiracy to remove former Prime Minister Erdogan from power in 2003."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2015",
                    "style": "bold"
                },
                "June - The pro-Kurdish leftwing People's Democratic Party (HDP) enters parliament at elections, depriving the governing AK party of its majority and scuppering plans for a referendum on executive powers for President Erdogan."
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/11648/production/_128004217_f7ff54d4-ac77-4ce0-8b11-d036f465beec.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "The breakdown of the ceasefire between the government and Kurdish rebels prompted renewed fighting in the south-east"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2015",
                    "style": "bold"
                },
                "November - Governing AK party regains parliamentary majority in snap elections, but falls short of numbers needed for referendum to boost President Erdogan's powers."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Turkey shoots down a Russian military jet on Syria bombing mission. Russia, Turkey's second-largest trading partner, imposes economic sanctions."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "European Union strikes a deal whereby Turkey restricts flow of migrants into Europe, in return for €3bn ($3.17bn) and concessions on stalled EU accession talks."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "February - Bomb attack on military convoy in the capital Ankara kills at least 38 people. A hard-line breakaway PKK faction - the Kurdistan Freedom Hawks (TAK) - claims responsibility."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "June - A gun and suicide attack on Istanbul's Ataturk airport kills 42 people, including 13 foreign nationals. Turkish authorities believe the attack bears the hallmarks of Islamic State."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "July - The authorities detain thousands of soldiers and judges on suspicion of involvement in a coup attempt that President Erdogan says was inspired by his exiled opponent Fethullah Gulen."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "The government also shuts down dozens of media outlets - including 16 TV channels - during a continuing crackdown in the wake of the failed coup attempt."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2016",
                    "style": "bold"
                },
                "August - Turkey's army and its Syrian National Army occupy areas of northern Syria."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2017",
                    "style": "bold"
                },
                "January - Uzbek gunman kills 39 people celebrating New Year at the Reina nightclub in Istanbul. Islamic State group says it was behind the attack."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2017",
                    "style": "bold"
                },
                "April - President Erdogan narrowly wins referendum to extend his powers. Opposition launches appeal against result."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2018",
                    "style": "bold"
                },
                "January - The Turkish military launches its ''Olive Branch'' land and air operation in north-western Syria, seizing large areas from Kurdish control, including the town of Afrin."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2019",
                    "style": "bold"
                },
                "June - President Erdogan suffers setback as opposition CHP party wins the mayoral election in his home city of Istanbul by a comfortable margin. He had insisted on a re-run of the poll when the CHP won narrowly in March."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2019",
                    "style": "bold"
                },
                "October - US withdraws troops from northern Syria, prompting Turkey to attack US Kurdish allies in the area."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2022",
                    "style": "bold"
                },
                "November - Bomb attack in Istanbul kills six and injures 81. Turkey blames Kurdish separatists and launches air attacks on nearly 500 targets in Syria and Iraq."
            ]
        }
    ]
}