{
    "title": "Zimbabwe profile - Timeline",
    "link": "https://www.bbc.co.uk/news/world-africa-14113618",
    "content": [
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/0CF2/production/_102141330_gettyimages-2637807.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "Zimbabwe was colonised by Cecil John Rhodes (centre) in the late 1800s. The country was named Southern Rhodesia after him"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "A chronology of key events:",
                    "style": "bold"
                }
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1200-1600s",
                    "style": "bold"
                },
                "- Rise and decline of the Monomotapa domain, thought to have been associated with Great Zimbabwe and to have been involved in gold mining and international trade."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1830s",
                    "style": "bold"
                },
                "- Ndebele people fleeing Zulu violence and Boer migration in present-day South Africa move north and settle in what becomes known as Matabeleland."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1830-1890s",
                    "style": "bold"
                },
                "- European hunters, traders and missionaries explore the region from the south. They include Cecil John Rhodes."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1889",
                    "style": "bold"
                },
                "- Rhodes' British South Africa Company obtains a British mandate to colonise what becomes Southern Rhodesia."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1890",
                    "style": "bold"
                },
                "- Pioneer column of European settlers arrives from south at site of future capital Harare."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1893",
                    "style": "bold"
                },
                "- Ndebele uprising against British South Africa Company rule is crushed."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1922",
                    "style": "bold"
                },
                "- British South Africa Company administration ends, the white minority opts for self-government."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1930",
                    "style": "bold"
                },
                "- Land Apportionment Act restricts black access to land, forcing many into wage labour."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1930-1960s",
                    "style": "bold"
                },
                "- Black opposition to colonial rule grows. Emergence in the 1960s of nationalist groups - the Zimbabwe African People's Union (Zapu) and the Zimbabwe African National Union (Zanu)."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1953",
                    "style": "bold"
                },
                "- Britain creates the Central African Federation, made up of Southern Rhodesia (Zimbabwe), Northern Rhodesia (Zambia) and Nyasaland (Malawi)."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1963",
                    "style": "bold"
                },
                "- Federation breaks up when Zambia and Malawi gain independence."
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/5B12/production/_102141332_gettyimages-954970614.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "White minority leader Ian Smith unilaterally declared independence from Britain in 1965"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1964",
                    "style": "bold"
                },
                "- Ian Smith of the Rhodesian Front becomes prime minister, tries to persuade Britain to grant independence."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1965",
                    "style": "bold"
                },
                "- Smith unilaterally declares independence under white minority rule, sparking international outrage and economic sanctions."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1972",
                    "style": "bold"
                },
                "- Guerrilla war against white rule intensifies, with rivals Zanu and Zapu operating out of Zambia and Mozambique."
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/F752/production/_102141336_gettyimages-515218908.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "Many people took up arms against the white minority government"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1978",
                    "style": "bold"
                },
                "- Smith yields to pressure for negotiated settlement. Zanu and Zapu boycott transitional legislature elections. New state of Zimbabwe Rhodesia, led by Bishop Abel Muzorewa, fails to gain international recognition."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1979",
                    "style": "bold"
                },
                "- British-brokered all-party talks lead to a peace agreement and new constitution guaranteeing minority rights."
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/A932/production/_102141334_gettyimages-3267792.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "The signing of the Lancaster House agreement led to independence. Future leader Robert Mugabe is pictured on the right"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1980",
                    "style": "bold"
                },
                "- Zanu leader Robert Mugabe wins independence elections. Zimbabwe wins international recognition in April."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1982",
                    "style": "bold"
                },
                "- Prime Minister Mugabe sacks Zapu leader Joshua Nkomo from the cabinet, accusing him of plotting to overthrow the government."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "North Korean-trained Fifth Brigade deployed to crush rebellion by Nkomo supporters in Midlands and Matabeleland provinces, and kill thousands of civilians over the next few years."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1987",
                    "style": "bold"
                },
                "- Mr Mugabe and Joshua Nkomo merge their parties to form Zanu-PF, dominated by Zanu."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1987",
                    "style": "bold"
                },
                "- Mr Mugabe changes constitution, becomes executive president."
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/14572/production/_102141338_gettyimages-3163280.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "Independence fighter Joshua Nkomo was a friend and then a rival of Robert Mugabe"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "1999",
                    "style": "bold"
                },
                "- Economic crisis worsened by Zimbabwe's unpopular military involvement in DR Congo civil war."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Opposition Movement for Democratic Change (MDC) formed."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2000",
                    "style": "bold"
                },
                "February - President Mugabe suffers defeat in referendum on draft constitution."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Squatters seize hundreds of white-owned farms in a violent campaign supported by the government."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2000",
                    "style": "bold"
                },
                "June - Zanu-PF narrowly fights off a challenge from the opposition MDC led by Morgan Tsvangirai at parliamentary elections, but loses its power to change the constitution."
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/1EEA/production/_102141970_gettyimages-853010250.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "Squatters invaded hundreds of white-owned farms in a government-supported campaign"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2001",
                    "style": "bold"
                },
                "July - Finance Minister Simba Makoni acknowledges economic crisis, saying foreign reserves have run out and warning of serious food shortages. Most western donors, including the World Bank and the IMF, cut aid because of President Mugabe's land seizure programme."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "February - Parliament passes a law limiting media freedom. The European Union imposes sanctions on Zimbabwe and pulls out its election observers after the EU team leader is expelled."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "March - President Mugabe re-elected in elections condemned as seriously flawed by the opposition and foreign observers. Commonwealth suspends Zimbabwe for a year."
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/941A/production/_102141973_gettyimages-53283932.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "The razing of \"illegal structures\" in 2005 left about 700,000 people without homes"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2002",
                    "style": "bold"
                },
                "April - State of disaster declared as worsening food shortages threaten famine."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2003",
                    "style": "bold"
                },
                "December - Zimbabwe pulls out of Commonwealth after the organisation decides to extend suspension of the country indefinitely."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2005",
                    "style": "bold"
                },
                "March - Zanu-PF wins two-thirds of the votes in parliamentary polls. Main opposition party says election was rigged against it."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2005",
                    "style": "bold"
                },
                "May-July - Tens of thousands of shanty dwellings and illegal street stalls are destroyed as part of a \"clean-up\" programme. The UN estimates that the drive has left about 700,000 people homeless."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2005",
                    "style": "bold"
                },
                "November - Ruling Zanu-PF party wins an overwhelming majority of seats in a newly-created upper house of parliament, the Senate."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2006",
                    "style": "bold"
                },
                "May - Year-on-year inflation exceeds 1,000%. New banknotes, with three noughts deleted from their values, are introduced in August."
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/E23A/production/_102141975_gettyimages-79105167.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "Galloping price increases rendered Zimbabwe's currency nearly worthless by 2008"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "March - Presidential and parliamentary elections. Opposition MDC claims victory."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "June - Robert Mugabe declared winner of run-off presidential election after Morgan Tsvangirai pulled out days before the poll, complaining of intimidation."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2008",
                    "style": "bold"
                },
                "July - EU, US widen sanctions against Zimbabwe's leaders."
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/1305A/production/_102141977_gettyimages-82818938.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "A power-sharing deal was signed by President Mugabe, left, and opposition leader Morgan Tsvangirai, centre. It was endorsed by South African President Thabo Mbeki, right"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2009",
                    "style": "bold"
                },
                "January - Government allows use of foreign currencies to try stem hyperinflation."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2009",
                    "style": "bold"
                },
                "February - Morgan Tsvangirai is sworn in as prime minister, after protracted talks over formation of government."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2009",
                    "style": "bold"
                },
                "September - IMF provides $400m support as part of G20 agreement to help member states."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "March - New \"indigenisation\" law forces foreign-owned businesses to sell majority stake to locals."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2010",
                    "style": "bold"
                },
                "August - Zimbabwe resumes official diamond sales, amid controversy over reported rights abuses at the Marange diamond fields."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Diamond fields 'plundered'"
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/15FBC/production/_102144009_gettyimages-163791731.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "The opposition dismissed the 2013 vote as fraudulent"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2013",
                    "style": "bold"
                },
                "March - New constitution approved by an overwhelming majority in a referendum. Future presidents will be limited to two five-year terms."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2013",
                    "style": "bold"
                },
                "July - Presidential and parliamentary elections. Mr Mugabe gains a seventh term in office and his Zanu-PF party three-quarters of the seats in parliament. The opposition MDC dismisses the polls as a fraud."
            ]
        },
        {
            "type": "image",
            "content": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/A2E8/production/_100040714_gettyimages-530148958.jpg"
        },
        {
            "type": "paragraph",
            "content": [
                "Morgan Tsvangirai endured years of intimidation as opponent of Robert Mugabe's authoritarian rule"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                "Obituary: Morgan Tsvangirai"
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2017",
                    "style": "bold"
                },
                "November - Mugabe resigns days after the military takes control, following a power struggle between supporters of his wife Grace and Zanu-PF veterans. Former vice-president Emmerson Mnangagwa becomes president."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2018",
                    "style": "bold"
                },
                "July - Mnangagwa narrowly wins presidential election over Nelson Chamisa of the MDC Alliance. Announces plans to stabilise economy and encourage foreign investment."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2018",
                    "style": "bold"
                },
                "November - President Mnangagwa announces two-year project by the Australian mining firm Invictus Energy to investigate potential large oil and gas deposits in Muzarabani district, near the border with Mozambique."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2019",
                    "style": "bold"
                },
                "January - Protests break out in major cities after the government more than doubles fuel prices in an attempt to tackle shortages and the black market."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2019",
                    "style": "bold"
                },
                "March - Cyclone Idai causes extensive flooding and loss of life in eastern provinces."
            ]
        },
        {
            "type": "paragraph",
            "content": [
                {
                    "text": "2019",
                    "style": "bold"
                },
                "June -Former president Robert Mugabe dies in Singapore, aged 95"
            ]
        }
    ]
}